# PointElementHostedOnFaceVParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementHostedOnFaceVParam Property
ParameterTypeId Class See Also
---
"Hosted V Parameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementHostedOnFaceVParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementHostedOnFaceVParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementHostedOnFaceVParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace